# LeaderOffsetSheet Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LeaderOffsetSheet Property
ParameterTypeId Class See Also
---
"Leader/Border Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LeaderOffsetSheet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LeaderOffsetSheet As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LeaderOffsetSheet {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace